In [2]:
!pip install mysql-connector

Collecting mysql-connector
  Using cached mysql_connector-2.2.9-cp312-cp312-win_amd64.whl
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [24]:
import mysql.connector
#importing database
database = mysql.connector.connect(
host="localhost",
user="root",
password="",

database = "python630"
)
db = database.cursor()

In [6]:
db.execute("SELECT * FROM student")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 89, 87, 79, 70, 77, 420, 80.0, 'A')
(2, 'Shyam', 89, 87, 79, 70, 77, 420, 80.0, 'A')

In [8]:
#insert data into table
sql = ''' INSERT INTO student (sn, name, physics, chemistry, math, english, nepali, total, per, grade)
VALUES (24, 'Ram', 78, 77, 99, 88, 87, 400, 78, 'B');'''
db.execute(sql)
database.commit()
print(db.rowcount, "record inserted.")

1 record inserted.

In [12]:
name = input("Enter name = ")
physics = int(input("Enter physics marks= "))
chemistry = int(input("Enter chemistry marks= "))
math = int(input("Enter math marks= "))
english = int(input("Enter english marks= "))
nepali = int(input("Enter nepali marks= "))

total = physics + chemistry + math + english + nepali
per = total/5

if per >= 80:
    grade = "A"
elif per >= 60:
    grade = "B"
elif per >= 45:
    grade = "C"
else:
    grade = "F"
    

#insert data into table
sql = f''' INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade)
        VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
db.execute(sql)
print(sql)
database.commit()
print(db.rowcount, "record inserted.")

Enter name =  Nabin
Enter physics marks=  78
Enter chemistry marks=  90
Enter math marks=  87
Enter english marks=  90
Enter nepali marks=  78

 INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade)
        VALUES ('Nabin', 78, 90, 87, 90, 78, 423, 84.6, 'A')
1 record inserted.

In [14]:
# Update in sql
sql = "UPDATE student SET name = 'Rama' WHERE sn = 2"
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) affected")

1 record(s) affected

In [22]:
# Update in sql
sql = "UPDATE student SET name = 'Rama' , grade = 'B' WHERE sn = 2"
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) affected")

1 record(s) affected

In [ ]:
# Select 
db.execute("SELECT * FROM student WHERE grade = 'A'")
result =db.fetchall()
for x in result:
    print(x)

In [26]:
# Select 
db.execute("SELECT name,total,grade FROM student WHERE grade = 'A'")
result =db.fetchall()
for x in result:
    print(x)

('Ram', 420, 'A')
('Akash', 443, 'A')
('Nabin', 423, 'A')

In [28]:
# Select 
db.execute("SELECT * FROM student WHERE physics > 80")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 89, 87, 79, 70, 77, 420, 80.0, 'A')
(2, 'Rama', 89, 87, 79, 70, 77, 420, 80.0, 'B')
(25, 'Akash', 89, 90, 87, 90, 87, 443, 88.6, 'A')

In [34]:
database.commit()

In [36]:
# search
db.execute("SELECT * FROM student WHERE name LIKE '%ram%'")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Balaram', 89, 87, 79, 70, 77, 420, 80.0, 'A')
(2, 'Rama', 89, 87, 79, 70, 77, 420, 80.0, 'B')
(24, 'Ram', 78, 77, 99, 88, 87, 400, 78.0, 'B')

In [42]:
# Select 
db.execute("SELECT * FROM student WHERE physics > 80 or chemistry=80")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Balaram', 89, 87, 79, 70, 77, 420, 80.0, 'A')
(2, 'Rama', 89, 87, 79, 70, 77, 420, 80.0, 'B')
(25, 'Akash', 89, 90, 87, 90, 87, 443, 88.6, 'A')

In [44]:
# Select 
db.execute("SELECT name,total,per,grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

('Balaram', 420, 80.0, 'A')
('Rama', 420, 80.0, 'B')
('Ram', 400, 78.0, 'B')
('Akash', 443, 88.6, 'A')
('Nabin', 423, 84.6, 'A')

In [48]:
# Select 
db.execute("SELECT * FROM student ORDER BY total DESC LIMIT 2")
result =db.fetchall()
for x in result:
    print(x)

(25, 'Akash', 89, 90, 87, 90, 87, 443, 88.6, 'A')
(26, 'Nabin', 78, 90, 87, 90, 78, 423, 84.6, 'A')

In [54]:
# Update in sql
name = input("Enter name = ")
sn = int(input("Enter sn = "))

sql = f"UPDATE student SET name = '{name}' WHERE sn = {sn}"
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) affected")

Enter name =  Anish
Enter sn =  25

1 record(s) affected

In [56]:
# search
name = input("Enter name = ")
db.execute(f"SELECT * FROM student WHERE name LIKE '%{name}%'")
result =db.fetchall()
for x in result:
    print(x)

Enter name =  Ram

(1, 'Balaram', 89, 87, 79, 70, 77, 420, 80.0, 'A')
(2, 'Rama', 89, 87, 79, 70, 77, 420, 80.0, 'B')
(24, 'Ram', 78, 77, 99, 88, 87, 400, 78.0, 'B')